//package com.testsystem.name.love;
//
//public class Tes {
//
//	public static void main(String[] args) {
//		// TODO Auto-generated method stub
//
//	//	GetName("孟","祥彬") ;
//		
//		int[] a = {16, 20} ;
//		GetNameXMM(15,a);
//	}
//
//	
//	
//	
//	 static double GetName(String 姓,String 名)
//     {
//
//         //五格计算
//         //1、易经的精髓是阴阳五行（金、木、水、土、火）1、3、5、7、9属阳；2、4、6、8、10属阴
//         //2、姓名有多种，复姓复名、复姓单名、单姓复名、单姓单名。
//         //3、计天格法：如是复姓，姓的笔画相加，得出天格数；如是单姓，姓的笔画加一得出天格数。
//         //4、计人格法：复姓复名姓氏的第二个字笔画加名的第一个字的笔画；复姓单名姓氏的第二个字加名的笔画；单姓复名是姓的笔画加名字的第一个字笔画；单姓单名是姓名相加的笔画数。
//         //5、计地格法：复姓复名和单姓复名都是名字相加的数；复姓单名和单姓单名是名的笔画数加一。
//         //7、计外格法：复姓复名是姓的第一个字和名的最后一个字相加的笔画数；复
//         //姓单名是复姓第一个字的笔画数加一；单姓复名应为最后一字笔画数加1；单姓单名统一为二。
//         //8、计总格法：姓名笔画数的总和。
//         //9、计算出了姓名的五格后，就是给五格配上阴、阳。数字超过十的只留个位数计算。如：15为还原成5，属 阳土；52还原成2，属阴木，此类推。
//         //10、得出阴阳关系后，再分辨五行的相生相克关系：木生火、火生土、土生金、金生水、水生木；木克土、土克水、水克火、火克金、金克木。
//         //11、姓名的好坏取决于三个关健因素：
//         //（1）、姓名数的内涵好坏（1--81数内涵列基础知识篇）。
//         //（2）、姓名五格的五行配置喜相生，忌相克。
//         //（3）、这也是最重要的一条，利用姓名学的五行来弥补和中和四柱（八字）中的不足。如果四柱中的缺项是木，（四柱无木不可成才）就在五格中补木的数理，又不能取含金的数
////理，这就是所谓的弥补；如果四柱中火弱透强杀，也在四柱中取含木的数理，因为五行顺生通关而有情，这就是中和的一种。类推。因为是最关健的一条，如果仅仅为了数理大吉和五行相生，疏略
////了四柱的先天情况，比如本来命主四柱中火旺，因看到含火的数理大吉，就加以太阳火的数理在姓名中，雪上加霜，岂不是令人着急。一句话，人的一生就好比一株花草，需要土的栽培、需要阳光
////照耀、需要水的滋润、需要剪刀修剪枝叶。缺一不可、过旺则损！
//
//
//         int 天格 = 0;
//         int 人格 = 0;
//         int 地格 = 0;
//         int 总格 = 0;
//         int 外格 = 0;
//
//         if (姓.length() ==1 )
//         {
//             if (名.length() == 1)
//             {
//                 return 0.0;
//             }
//             else
//             {
//                //    int ix1 = WordIndex[姓].康熙笔画;
//            	 int ix1 = rod() ;
//                 
//                 if (ix1 == 0)
//                 {
//                   //  ix1 = WordIndex[姓].简体笔画;
//                	 ix1 = 12 ;
//                 }
//
//                 int im1 = 0;
//                 { 
//                     String stmp = 名.substring(0, 1);
//                    // im1 = WordIndex[stmp].康熙笔画;
//                     im1 = rod() ;
//                     if (im1 == 0)
//                     {
//                        // im1 = WordIndex[stmp].简体笔画;
//                         im1 =  12 ;
//                     }
//                 }
//
//                 天格 = ix1 + 1;
//
//                 人格 = ix1 + im1;
//
//                 地格 = 0;
//
//                 int imn = 0;
//                 int ims = 0;
//                 for ( int fi = 0; fi < 名.length();fi++)
//                 {
//                     String stmp = 名.substring(fi, 1);
//                   //  imn = WordIndex[stmp].康熙笔画;
//                     imn =rod() ;
//                     
//                     if (imn == 0)
//                     {
//                        // imn = WordIndex[stmp].简体笔画;
//                         imn =12 ;
//                     }
//                     ims += imn;
//                     地格 += imn;
//                 }
//
//                 外格 = 1 + imn;
//
//                 总格 = ix1 + ims;
//
//                 return TotalToNum(天格, 人格, 地格, 总格, 外格);
//             }
//         }
//         else
//         {
//             return 0.0;
//         }
//     }
//
//
//     static double GetNameXMM(int 姓, int[] 名)
//     {
//         
//         int 天格 = 0;
//         int 人格 = 0;
//         int 地格 = 0;
//         int 总格 = 0;
//         int 外格 = 0;
//
//         int ix1 = 姓;
//
//         int im1 = 名[0]; 
//
//         天格 = ix1 + 1;
//
//         人格 = ix1 + im1;
//
//         地格 = 0;
//
//         int imn = 0;
//         int ims = 0;
//         for (int fi = 0; fi < 名.length; fi++)
//         {                
//             imn = 名[fi];
//             
//             ims += 名[fi];
//             地格 += imn;
//         }
//
//         外格 = 1 + imn;
//
//         总格 = ix1 + ims;
//    	 System.out.println( 天格 +"-"+ 人格 +"-"+ 地格 +"-"+ 总格 +"-"+外格);
//    	 
//         return TotalToNum(天格, 人格, 地格, 总格, 外格);
//     }
//
//
//     static String Get81(int iVal)
//     {
//    	 
//    	  System.out.println(iVal);
//         if (iVal > 81)
//         {
//             iVal -= 81;
//         }
//       
//         return new SL81Class().SL81[iVal];
//     }
//     
//     static class SL81Class
//     {
//         public static String[] SL81 = new String[82];
//         public static String[] SL81_yy = new String[82];
//         public static String[] SL81_as = new String[82];
//         public static String[] SL81_cn = new String[82];
//
//         public   SL81Class()
//         {
//             SL81[1] = "大吉";
//             SL81[2] = "大凶";
//             SL81[3] = "大吉";
//             SL81[4] = "凶";
//             SL81[5] = "大吉";
//             SL81[6] = "半吉";
//             SL81[7] = "吉";
//             SL81[8] = "吉";
//             SL81[9] = "凶";
//             SL81[10] = "凶";
//             SL81[11] = "大吉";
//             SL81[12] = "凶";
//             SL81[13] = "大吉";
//             SL81[14] = "凶";
//             SL81[15] = "大吉";
//             SL81[16] = "大吉";
//             SL81[17] = "半吉";
//             SL81[18] = "大吉";
//             SL81[19] = "凶";
//             SL81[20] = "凶";
//             SL81[21] = "大吉";
//             SL81[22] = "凶";
//             SL81[23] = "大吉";
//             SL81[24] = "大吉";
//             SL81[25] = "大吉";
//             SL81[26] = "半吉";
//             SL81[27] = "半吉";
//             SL81[28] = "凶";
//             SL81[29] = "半吉";
//             SL81[30] = "半吉";
//             SL81[31] = "大吉";
//             SL81[32] = "大吉";
//             SL81[33] = "大吉";
//             SL81[34] = "大凶";
//             SL81[35] = "大吉";
//             SL81[36] = "凶";
//             SL81[37] = "大吉";
//             SL81[38] = "半吉";
//             SL81[39] = "大吉";
//             SL81[40] = "凶";
//             SL81[41] = "大吉";
//             SL81[42] = "凶";
//             SL81[43] = "凶";
//             SL81[44] = "凶";
//             SL81[45] = "大吉";
//             SL81[46] = "凶";
//             SL81[47] = "大吉";
//             SL81[48] = "大吉";
//             SL81[49] = "半吉";
//             SL81[50] = "凶";
//             SL81[51] = "半吉";
//             SL81[52] = "大吉";
//             SL81[53] = "凶";
//             SL81[54] = "凶";
//             SL81[55] = "半吉";
//             SL81[56] = "凶";
//             SL81[57] = "大吉";
//             SL81[58] = "半吉";
//             SL81[59] = "凶";
//             SL81[60] = "凶";
//             SL81[61] = "大吉";
//             SL81[62] = "凶";
//             SL81[63] = "大吉";
//             SL81[64] = "凶";
//             SL81[65] = "大吉";
//             SL81[66] = "凶";
//             SL81[67] = "大吉";
//             SL81[68] = "凶";
//             SL81[69] = "凶";
//             SL81[70] = "凶";
//             SL81[71] = "半吉";
//             SL81[72] = "半吉";
//             SL81[73] = "凶";
//             SL81[74] = "凶";
//             SL81[75] = "半吉";
//             SL81[76] = "凶";
//             SL81[77] = "半吉";
//             SL81[78] = "凶";
//             SL81[79] = "凶";
//             SL81[80] = "凶";
//             SL81[81] = "大吉";
//
//
//             SL81_yy[1] = "（太极之数）太极之数，万物开泰，生发无穷，利禄亨通。";
//             SL81_yy[2] = "（两仪之数）两仪之数，混沌未开，进退保守，志望难达。";
//             SL81_yy[3] = "（三才之数）三才之数，天地人和，大事大业，繁荣昌隆。　";
//             SL81_yy[4] = "（四象之数）四象之数，待于生发，万事慎重，不具营谋。";
//             SL81_yy[5] = "（五行之数）五行俱权，循环相生，圆通畅达，福祉无穷。";
//             SL81_yy[6] = "（六爻之数）六爻之数，发展变化，天赋美德，吉祥安泰。　";
//             SL81_yy[7] = "（七政之数）七政之数，精悍严谨，天赋之力，吉星照耀。　";
//             SL81_yy[8] = "（八卦之数）八卦之数，乾坎艮震，巽离坤兑，无穷无尽。　";
//             SL81_yy[9] = "（大成之数）大成之数，蕴涵凶险，或成或败，难以把握。";
//             SL81_yy[10] = "（终结之数）终结之数，雪暗飘零，偶或有成，回顾茫然。　";
//             SL81_yy[11] = "（旱苗逢雨）万物更新，调顺发达，恢弘泽世，繁荣富贵。　";
//             SL81_yy[12] = "（掘井无泉）无理之数，发展薄弱，虽生不足，难酬志向。";
//             SL81_yy[13] = "（春日牡丹）才艺多能，智谋奇略，忍柔当事，鸣奏大功。";
//             SL81_yy[14] = "（破兆） 家庭缘薄，孤独遭难，谋事不达，悲惨不测。";
//             SL81_yy[15] = "（福寿） 福寿圆满，富贵荣誉，涵养雅量，德高望重。";
//             SL81_yy[16] = "（厚重） 厚德载物，安富尊荣，财官双美，功成名就。";
//             SL81_yy[17] = "（刚强） 权威刚强，突破万难，如能容忍，必获成功。　";
//             SL81_yy[18] = "（铁镜重磨）权威显达，博得名利，且养柔德，功成名就。";
//             SL81_yy[19] = "（多难） 风云蔽日，辛苦重来，虽有智谋，万事挫折。";
//             SL81_yy[20] = "（屋下藏金）非业破运，灾难重重，进退维谷，万事难成。";
//             SL81_yy[21] = "（明月中天）光风霁月，万物确立，官运亨通，大搏名利。女性不宜此数。　";
//             SL81_yy[22] = "（秋草逢霜）秋草逢霜，困难疾弱，虽出豪杰，人生波折。";
//             SL81_yy[23] = "（壮丽） 旭日东升，壮丽壮观，权威旺盛，功名荣达。女性不宜此数。";
//             SL81_yy[24] = "（掘藏得金）家门余庆，金钱丰盈，白手成家，财源广进。　";
//             SL81_yy[25] = "（荣俊） 资性英敏，才能奇特，涵养性情，可成大业。　";
//             SL81_yy[26] = "（变怪） 变怪之谜，英雄豪杰，波澜重叠，而奏大功。　";
//             SL81_yy[27] = "（增长） 欲望无止，自我强烈，多受毁谤，尚可成功。";
//             SL81_yy[28] = "（阔水浮萍）遭难之数，豪杰气概，四海漂泊，终世浮躁。女性不宜此数。";
//             SL81_yy[29] = "（智谋） 智谋优秀，财力归集，名闻海内，成就大业。　";
//             SL81_yy[30] = "（非运） 沉浮不定，凶吉难变，若明若暗，大成大败。　";
//             SL81_yy[31] = "（春日花开）智勇得志，博得名利，统领众人，繁荣富贵。";
//             SL81_yy[32] = "（宝马金鞍）侥幸多望，贵人得助，财帛如裕，繁荣至上。";
//             SL81_yy[33] = "（旭日升天）旭日升天，鸾凤相会，名闻天下，隆昌至极。女性不宜此数。";
//             SL81_yy[34] = "（破家） 破家之身，见识短小，辛苦遭逢，灾祸至极。";
//             SL81_yy[35] = "（高楼望月）温和平静，智达通畅，文昌技艺，奏功洋洋。　";
//             SL81_yy[36] = "（波澜重叠）波澜重叠，沉浮万状，侠肝义胆，舍己成仁。　";
//             SL81_yy[37] = "（猛虎出林）权威显达，热诚忠信，宜着雅量，终身荣富。";
//             SL81_yy[38] = "（磨铁成针）意志薄弱，刻意经营，才识不凡，技艺有成。";
//             SL81_yy[39] = "（富贵荣华）富贵荣华，财帛丰盈，暗藏险象，德泽四方。　";
//             SL81_yy[40] = "（退安） 智谋胆力，冒险投机，沉浮不定，退保平安。";
//             SL81_yy[41] = "（有德） 纯阳独秀，德高望重，和顺畅达，博得名利。此数为最大好运数。　";
//             SL81_yy[42] = "（寒蝉在柳）博识多能，精通世情，如能专心，尚可成功。　";
//             SL81_yy[43] = "（散财破产）散财破产，诸事不遂，虽有智谋，财来财去。";
//             SL81_yy[44] = "（烦闷） 破家亡身，暗藏惨淡，事不如意，乱世怪杰。　";
//             SL81_yy[45] = "（顺风） 新生泰和，顺风扬帆，智谋经纬，富贵繁荣。";
//             SL81_yy[46] = "（浪里淘金）载宝沉舟，浪里淘金，大难尝尽，大功有成。　　";
//             SL81_yy[47] = "（点石成金）花开之象，万事如意，祯祥吉庆，天赋幸福。";
//             SL81_yy[48] = "（古松立鹤）智谋兼备，德量荣达，威望成师，洋洋大观。　";
//             SL81_yy[49] = "（转变） 吉临则吉，凶来则凶，转凶为吉，配好三才。　";
//             SL81_yy[50] = "（小舟入海）一成一败，吉凶参半，先得庇荫，后遭凄惨。";
//             SL81_yy[51] = "（沉浮） 盛衰交加，波澜重叠，如能慎始，必获成功。　";
//             SL81_yy[52] = "（达眼） 卓识达眼，先见之明，智谋超群，名利双收。　";
//             SL81_yy[53] = "（曲卷难星）外祥内患，外祸内安，先富后贫，先贫后富。";
//             SL81_yy[54] = "（石上栽花）石上栽花，难得有活，忧闷烦来，辛惨不绝。　";
//             SL81_yy[55] = "（善恶） 善善得恶，恶恶得善，吉到极限，反生凶险。　";
//             SL81_yy[56] = "（浪里行舟）历尽艰辛，四周障碍，万事龃龌，做事难成。";
//             SL81_yy[57] = "（日照春松）寒雪青松，夜莺吟春，必遭一过，繁荣白事。";
//             SL81_yy[58] = "（晚行遇月）沉浮多端，先苦后甜，宽宏扬名，富贵繁荣。";
//             SL81_yy[59] = "（寒蝉悲风）寒蝉悲风，意志衰退，缺乏忍耐，苦难不休。　";
//             SL81_yy[60] = "（无谋） 无谋之人，漂泊不定，晦暝暗黑，动摇不安。　";
//             SL81_yy[61] = "（牡丹芙蓉）牡丹芙蓉，花开富贵，名利双收，定享天赋。　";
//             SL81_yy[62] = "（衰败） 衰败之象，内外不和，志望难达，灾祸频来。　";
//             SL81_yy[63] = "（舟归平海）富贵荣华，身心安泰，雨露惠泽，万事亨通。";
//             SL81_yy[64] = "（非命） 骨肉分离，孤独悲愁，难得心安，做事不成。";
//             SL81_yy[65] = "（巨流归海）天长地久，家运隆昌，福寿绵长，事事成就。";
//             SL81_yy[66] = "（岩头步马）进退维谷，艰难不堪，等待时机，一跃而起。";
//             SL81_yy[67] = "（顺风通达）天赋幸运，四通八达，家道繁昌，富贵东来。";
//             SL81_yy[68] = "（非业） 非业非力，精神迫滞，灾害交至，遍偿痛苦。";
//             SL81_yy[69] = "（非业） 非业非力，精神迫滞，灾害交至，遍偿痛苦。";
//             SL81_yy[70] = "（残菊逢霜）残菊逢霜，寂寞无碍，惨淡忧愁，晚景凄凉。";
//             SL81_yy[71] = "（石上金花）石上金花，内心劳苦，贯彻始终，定可昌隆。";
//             SL81_yy[72] = "（无勇） 盛衰交加，徒有高志，天王福祉，终世平安。　";
//             SL81_yy[73] = "（残菊经霜）残菊经霜，秋叶寂寞，无能无智，辛苦繁多。";
//             SL81_yy[74] = "（残菊经霜）残菊经霜，秋叶寂寞，无能无智，辛苦繁多。";
//             SL81_yy[75] = "（退守） 退守保吉，发迹甚迟，虽有吉象，无谋难成。";
//             SL81_yy[76] = "（离散） 倾覆离散，骨肉分离，内外不和，虽劳无功。";
//             SL81_yy[77] = "（半吉） 家庭有悦，半吉半凶，能获援护，陷落不幸。　";
//             SL81_yy[78] = "（晚苦） 祸福参半，先天智能，中年发达，晚景困苦。　";
//             SL81_yy[79] = "（云头望月）云头望月，身疲力尽，穷迫不伸，精神不定。";
//             SL81_yy[80] = "（遁吉） 辛苦不绝，早入隐遁，安心立命，化凶转吉。";
//             SL81_yy[81] = "（万物回春）最吉之数，还本归元，吉祥重叠，富贵尊荣。";
//
//
//             SL81_as[1] = "大吉运";
//             SL81_as[2] = "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等） ";
//             SL81_as[3] = "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）"; 
//             SL81_as[4] = "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）< BR > 孤独运（妻凌夫或夫克妻）";
//             SL81_as[5] = "吉祥运（表示健全、幸福、名誉等）< BR > 男性双妻运< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[6] = "次吉祥运（表示多少有些障碍，但能获得吉运）< BR > 男性双妻运< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[7] =  "吉祥运（表示健全、幸福、名誉等）< BR > 刚情运（性刚固执、意气用事）"; 
//             SL81_as[8] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[9] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[10] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）< BR > 孤独运（妻凌夫或夫克妻）"; 
//             SL81_as[11] =  "吉祥运（表示健全、幸福、名誉等）< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[12] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等） < BR > 孤独运（妻凌夫或夫克妻）"; 
//             SL81_as[13] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）"; 
//             SL81_as[14] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能） < BR > 孤独运（妻凌夫或夫克妻）"; 
//             SL81_as[15] =  "富贵运（多钱财、富贵、白手可获巨财） < BR > 吉祥运（表示健全、幸福、名誉等） < BR > 男性双妻运< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[16] =  "首领运（智慧仁勇、立上位、能领导众人） < BR > 富贵运（多钱财、富贵、白手可获巨财）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 男性双妻运< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[17] =  "次吉祥运（表示多少有些障碍，但能获得吉运） < BR > 刚情运（性刚固执、意气用事）"; 
//             SL81_as[18] =  "吉祥运（表示健全、幸福、名誉等）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）< BR > 刚情运（性刚固执、意气用事）"; 
//             SL81_as[19] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[20] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[21] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[22] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等） < BR > 孤独运（妻凌夫或夫克妻）"; 
//             SL81_as[23] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）"; 
//             SL81_as[24] =  "富贵运（多钱财、富贵、白手可获巨财） < BR > 吉祥运（表示健全、幸福、名誉等）< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[25] =  "吉祥运（表示健全、幸福、名誉等） < BR > 刚情运（性刚固执、意气用事）"; 
//             SL81_as[26] =  "次吉祥运（表示多少有些障碍，但能获得吉运）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）";
//             SL81_as[27] =  "次吉祥运（表示多少有些障碍，但能获得吉运） < BR > 刚情运（性刚固执、意气用事）";
//             SL81_as[28] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）< BR > 孤独运（妻凌夫或夫克妻）< BR > 刚情运（性刚固执、意气用事）";
//             SL81_as[29] =  "首领运（智慧仁勇、立上位、能领导众人） < BR > 富贵运（多钱财、富贵、白手可获巨财） < BR > 次吉祥运（表示多少有些障碍，但能获得吉运） < BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）"; 
//             SL81_as[30] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[31] =  "首领运（智慧仁勇、立上位、能领导众人） < BR > 吉祥运（表示健全、幸福、名誉等）< BR > 温和运（性情平和、能得上下信望）";
//             SL81_as[32] =  "富贵运（多钱财、富贵、白手可获巨财）  < BR > 吉祥运（表示健全、幸福、名誉等） < BR > 男性双妻运 < BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[33] =  "富贵运（多钱财、富贵、白手可获巨财）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）"; 
//             SL81_as[34] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）< BR > 孤独运（妻凌夫或夫克妻）"; 
//             SL81_as[35] =  "吉祥运（表示健全、幸福、名誉等） < BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）< BR > 温和运（性情平和、能得上下信望）"; 
//             SL81_as[36] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[37] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 刚情运（性刚固执、意气用事）"; 
//             SL81_as[38] =  "次吉祥运（表示多少有些障碍，但能获得吉运） < BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）"; 
//             SL81_as[39] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 男性双妻运"; 
//             SL81_as[40] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[41] =  "首领运（智慧仁勇、立上位、能领导众人） < BR > 富贵运（多钱财、富贵、白手可获巨财） < BR > 吉祥运（表示健全、幸福、名誉等） < BR > 男性双妻运"; 
//             SL81_as[42] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[43] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[44] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[45] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）"; 
//             SL81_as[46] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[47] =  "首领运（智慧仁勇、立上位、能领导众人）< BR > 吉祥运（表示健全、幸福、名誉等）< BR > 刚情运（性刚固执、意气用事）";
//             SL81_as[48] =  "吉祥运（表示健全、幸福、名誉等）< BR > 艺能运（富有艺术天才，对审美、艺术、演艺、体育有通达之能）"; 
//             SL81_as[49] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[50] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[51] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[52] =  "富贵运（多钱财、富贵、白手可获巨财） < BR > 吉祥运（表示健全、幸福、名誉等）"; 
//             SL81_as[53] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[54] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[55] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[56] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[57] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[58] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[59] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[60] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[61] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[62] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[63] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[64] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[65] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[66] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[67] =  "吉祥运（表示健全、幸福、名誉等）";
//             SL81_as[68] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[69] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[70] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[71] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[72] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[73] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[74] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[75] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[76] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[77] =  "次吉祥运（表示多少有些障碍，但能获得吉运）";
//             SL81_as[78] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[79] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[80] =  "凶数运（表示逆境、沉浮、薄弱、病难、困难、多灾等）";
//             SL81_as[81] =  "吉祥运（表示健全、幸福、名誉等）";
//
//
//             SL81_cn[1] =  "天地开泰万事成，身体康安亦富荣，否泰名誉兼享福，一生无忧乐绵长。繁荣发达，信用得固，万人仰望，可获成功。万物开泰，最大吉祥的暗示，但常人恐不当。天地开端﹐万物创始之象﹐威望﹑长寿之运格﹐有独立﹑单行﹑健全﹑发达﹑富贵﹑名誉﹑幸福﹑长寿等暗示力﹐宜静不宜动﹐静可得良机﹐如旭日东升﹐以温和步骤﹐可获得成功﹐事半功倍﹐但对常人恐有过好﹐不堪当之之数也。（吉）天地开端创始之象，有始收，富贵，长寿，乃为大吉之数，但宜静不宜动，静可得良机，如旭日东升，以温和步伐，可获大成功，健康，荣华，名誉，终生幸福之命运也。因数过";
//             SL81_cn[2] =  "未定的分离破灭数，混沌未定，为最大凶恶的暗示。< BR >诗曰：混浊未定如萍动，乱离不安亦波浪，独立无力多灾难，变动病弱又短命。< BR >< BR >一身孤节，属末定的分离破灭数。（大凶）< BR >基业：劫财、破灭、灾危、破家、红艳、变迁、美貌。< BR >家庭：亲情疏远、夫妻应相互理解、则免别离之苦。< BR >健庭：凶弱、短亦有之，易患皮肤病外伤、矢折。< BR >含义：混沌末定数。为最大凶恶的暗示，无独力之气力进退失自由、其内外生波澜因苦不安。摇动、病患遭难，甚至残废。如伴有其他好数者不致夭折，其人辛苦一生，";
//             SL81_cn[3] =  "进取如意的增进繁荣数，成功发达之兆，名利双全。< BR >诗曰：进取如意又富贵，知达明敏扬名威，名利寿福可安宁，前途光芒好鸿图。< BR >< BR >吉祥，进取如意的增进繁荣数。（大吉）< BR >基业：术、技艺、祖业、丰盛自立、建业官禄。< BR >家庭：家内施惠，可得贤妻六亲和睦须戒自私。< BR >健康：松柏林立，健康良好，可望长寿。< BR >含义：阴阳抱合，万物确定形成之象，有吉祥、成功发达之兆。智达明敏，艺精工巧有首领之资，自然之福。名利双全能成大事业，荣进有望，福祉无穷。"; 
//             SL81_cn[4] =  "万事休止数，不足不全如同画饼充饥。< BR >诗曰：溯体凶变不具整，残废病难兼夭折，破家亡身招灾祸，苦苦之中有孝人。< BR >< BR >凶变，身遭凶变的万事休止符。（凶）< BR >基业：美貌、香艳、破家、灾危、劫财；损家业。< BR >家庭：六亲缘薄、兄弟如同画饼，热心相助者少。应看开一些。< BR >健康：衰弱，外伤，皮肤病，夭折病死，发狂病。< BR >含义：属破坏的凶就数，不足不全的灭亡之数。进退不自由，独立乏能力。大多辛苦困难，或者与其他凶运配合而致发狂病死，夭折。或者放浪，破灭，逆难终成废人。但孝子、节"; 
//             SL81_cn[5] =  "福禄长寿，阴阳和合、完壁之象，最大吉数。< BR >诗曰：福禄寿长阴阳和，心身健全是英豪，名利双收富荣达，乃是世上福德人。< BR >< BR >种竹成林、福禄长寿的福禄集合数。（大吉）< BR >基业：学者、祖业、文昌、福星、官星、财钱。< BR >家庭：上下和睦，相互合作，可望圆满，子女多荫。< BR >健康：福禄如海，寿比南山。可望健康。< BR >含义：阴阳交感，和合，完璧之象，隐藏大成功运。精神敏锐，身体健全，福禄长寿，富贵繁荣，无所不至或为中兴之祖，或在他乡成家，或复兴绝家。即或不如此，也会博得功名荣誉，圆"; 
//             SL81_cn[6] =  "吉人自有天相数，逢凶化吉不在话下。< BR >诗曰：安稳余庆福禄开，盛大幸福天赐来，内含衰兆就谨慎，天乙贵人守身边。< BR >< BR >安稳吉庆的吉人天相数。（半吉）< BR >基业：豪杰、官禄、财钱、将星、学者。< BR >健康：逢凶化吉，遇一次生险，可得长寿。< BR >含义：天德地祥具备，福庆甚广，家势盛大万宝朝宗之运然满极必损，盈极必亏，若其他要素配合的不周者，恐或如流水而下，成为所谓乐极生悲之象，此数理具有天赋之美，安稳吉庆终生。"; 
//             SL81_cn[7] =  "刚毅果断、勇往直前，精力充足，排除万难。只是应涵养量。< BR >诗曰：刚毅果断除万难，独立权威志气安，内外和好兼柔性，温和养德耀吉星。< BR >< BR >精悍，刚毅果断勇往直前的进取数。（吉）< BR >基业：独立、官禄、进取、技术、刚硬。< BR >家庭：缺乏同心力，内外不合，善涵养修身者事得家庭圆满。 < BR > 健康：日月光明，心身健保，可望长寿。< BR > 含义：独立、单行、极感之象，过刚而缺乏同化力之意。如果顽刚弄权，易酿成内外不和，幸而天赋的精力充沛，具有调节事物的才能，能够粉碎硬敌，排除万难，若能涵养";
//             SL81_cn[8] =  "意志刚键、勤勉发展、富于进取的气概。性直。<BR>诗曰：意志刚强善恶明，富进取心求和平，忍耐克己如心意，前难后成可安然。<BR><BR>坚刚，志刚意健的勤勉发展数。（吉）<BR>基业：艺能、美术、学者、官禄、天官、师表、蓄产。<BR>家庭：兴家成为达人贤者，家境先难后易。<BR>健康：高山立松完健自在，可望长寿。<BR>含义：意志如铁石，富于进取的气概。排除万难，贯彻目的名利两得，忍耐克己逐成大功。但其他运配合不善者，可能有遭难的厄运。";
//             SL81_cn[9] =  "吉尽凶始，穷乏之数。有不测灾祸，实为人生最大恶运。<BR>诗曰：与尽凶始入困途，窘迫病难失亲和，灾害短命无所止，生离死别却哀悲。<BR><BR>破舟进海，吉尽凶相，穷乏之数。（凶）<BR>基业：官禄、图印、太极、怪杰、富翁、突破。<BR>家庭：亲情不睦，口说长短者多，力持贤明者平安。<BR>健康：女性成风流或与夫别离病弱，弱女皆晚婚。多积德可免短命。<BR>含义：利去劫空，陷落穷迫、逆运、短命，悲痛或者幼小离亲而困苦，或者病弱，不遇，遭难废疾，贫困，灾难，孤独甚至刑罚。有不测遇凶祸，人格有此";
//             SL81_cn[10] =  "万物终局，充满损耗数，大凶，不宜使用。<BR>诗曰：万事终局万事空，逆难失意逢空亡，病弱短命多暗淡，克夫伤子破家风。<BR><BR>零暗，万业终局充满损耗数。（凶）<BR>基业：天福、文昌、散财、官禄、破危、矢寿。<BR>家庭：家内总是冷眼旁观者多，伤害妻子破镜难圆、百忍者尚可平安。<BR>健康：杀伤刑罚，病弱、灾危、女易风流。心性变态。<BR>含义：境地悲凄，空虚无物，人格有此数者，多灾短命。如同日没，四顾茫茫，神哭鬼嚎凶之象，行万象乏气力，常陷于不如意，凡要求功，因多障碍渐自失败，遂致破";
//             SL81_cn[11] =  "旱苗逢雨、枯木逢春。得挽回家运的最大吉数。<BR>诗曰：挽回家运矣春光，顺调发展财辉煌，温和笃实阴阳合，稳健顺序得人望。<BR><BR>早苗逢雨，挽回家运的春成育数。（大吉）<BR>基业：财星。天佑、暗禄、文昌、技艺、田宅。<BR>家庭：养蜂结蜜，事事和顺，处处温和。<BR>健康：河川永在，可望健康长寿。<BR>含义：享天赋幸运，万事顺利，有得富贵荣誉，再兴家的暗示，得挽回家运平静和顺的最大吉数。";
//             SL81_cn[12] =  "意志脆弱、家庭寂寞，企图不顾薄弱之力做无能力的事多失败。<BR>诗曰：意志薄弱不伸长，易招失败遇灾殃，家属缘薄孤独命，安居守分保平安。<BR><BR>掘井无泉，意志脆弱，家庭寂寞数。（凶）<BR>基业：凶星、破厄、劫财、时禄。<BR>家庭：亲情如秋水，骨肉似寒炭，施恩招怨。宜提高气节健康：枯木待春，小心神经衷弱，骨癌之疾、外伤、皮肤病，三才良者可安全。<BR>含义：有无理伸张之象，不顾脆弱之力，企图做无能力做的事，多失败。遇事易生足之心。家庭无缘，孤独、遇难、逆境、病弱、不如意、困难等，又可因";
//             SL81_cn[13] =  "智勇超群的大成功数，充满智慧是其特点。<BR>诗曰：智略超群博学多，善事事路亦忍和，功业成就得富荣，艺才相身乐千锺。<BR><BR>智能超群的成功数。（大吉）<BR>基业：大官、文昌、技艺、进财、学士、田产、财库。<BR>健康：可能健全长寿、先天五行不和者不遇。<BR>含义：富学艺才能，有智谋奇略，忍柔当事，任何难事皆巧于奏大功。为得享福贵荣华的好诱导，充满智满是其特点。(by senlon)";
//             SL81_cn[14] =  "沦落天涯、失意烦闷数，家庭缘薄，多破兆。<BR>诗曰：沦落天涯失古恃，家族缘薄又克儿，寂寞类闷多灾厄，己身浮沈无可樨。<BR><BR>沦落天崖的失意烦闷的数。（凶）<BR>基业：暗禄、美貌、艺术、流浪、红舞、劫财。<BR>家庭：骨肉疏远。离祖迁居。自家兄弟全无分、外处事又能缘。<BR>健康：男女均属好貌、皮肤病、感胃、风郁，先天五行相含有健康。<BR>含义：多破兆，家属缘溥。丧亲、丧子、兄弟姐妹分离孤独，不如意，烦闷，危难，遭厄，浮沉不定，为了慷慨。施惠招怨，劳而无功，凄惨孤独，其他好运者不";
//             SL81_cn[15] =  "最大好运，福寿圆满之象。<BR>诗曰：福寿拱照德望高，财子寿全又温和，慈祥好善可恭敬，富贵繁荣得惠泽。<BR><BR>福寿共照的立身家数。（大吉）<BR>基业：天官，贵人，福星、官禄、进田、畜产。<BR>家庭：清静家田，园满之象子孙昌盛。<BR>健康：海底明珠，安稳徐庆，健康自如。<BR>含义：此数为最大好运，福寿园满之象，顺和、雅量。多受福泽，德高望重，自成大业，富贵荣华，吉祥有德，繁荣兴家的大吉数。";
//             SL81_cn[16] =  "反凶化吉象，得助，可成大业，富贵发达的好预兆。<BR>诗曰：贵人得助天乙扶，为人之上有财富，众望所归事业成，不可贪色保安宁。<BR><BR>兴家得助的贵数。（大吉）<BR>基业：天官、贵命、家杰、进田、学士、豪侠、基产。<BR>家庭：春日花开，可望家庭圆满，男子有贤妻，女子不宜早婚。<BR>健康：花草逢春，贵弱于色情，戒慎者可望安康。<BR>含义：反凶化吉象。成首领，占上风，雅量厚重，豪侠足智多谋，善于协调，集名望。能服从，为大事大业可成，富贵发达的好表示。";
//             SL81_cn[17] =  "权威刚强，有己无人，以至于与人不和，如避开此短处则为大吉。<BR>诗曰：突破万难权威高，刚性固执如英豪，须事谨慎守和平，可得大功福绵绵。<BR><BR>突破万难的刚柔兼备数。（半吉）<BR>基业：天宫、将星、威武、艺术、文明。<BR>家庭：女性若能教养女德，贤慧者可望园满。<BR>健康：心身健康，可望长寿。<BR>含义：权威刚强，有已无人，以至与人不和，如善于避开此短处，则为大吉。意志坚定，具突破万难的气节是其最大的优点。如过于无理任性，恐反成失败，如果立志勇往向前，必成功而建大业。若陷过刚";
//             SL81_cn[18] =  "有志竟成的内外吉数，一旦立志必排除万难，博得名利。但自我心过强。<BR>诗曰：有志竟成事皆通，智谋发展有威望，过刚遭难咸柔德，博得名利大成功。<BR><BR>有志竟成的内外吉数。（大吉）<BR>基业：将星、文昌、太极、畜产，财帛，技艺。<BR>家庭：有祖宗荫庇之。心慈口硬，宜守和不可望园满。<BR>健康：心身健全如万年蛇，可望长寿。<BR>含义：铁石心发达运具备，有权力、智谋。志向一立，必破诸难，博得名利。但自我心强，乏包涵力。要戒坚刚，诱发非难。宜养柔德，且惧险勿临，则目的贯彻，功名成就。";
//             SL81_cn[19] =  "有智谋，有兴大业博名利的实力，但每每发生意外障碍，内外不和、困难不绝，如其他格不吉，也有短命的可能。<BR>诗曰：风云蔽月未得安，虽有智慧做事难，孤独多难无所至，内外不和失妻儿。<BR><BR>遮云蔽月的辛苦重来数。（凶）<BR>基业：官禄、进田、经艳、财帛、智谋、凶危破财。<BR>家庭；家内朝思幕致，兄弟成吴越，须思手足情应多注意。<BR>健康：风云蔽月，病弱、刑罚、杀伤、短命，先天五行属金水者可望安康。<BR>含义：有多智谋，虽有兴大业，博得名利的实力，但每发生意外的陷害，内外不和，困难";
//             SL81_cn[20] =  "非业空虚，泥身进海，难以为继，有物将坏这象，最大凶数。<BR>诗曰：非业破运灾祸重，厄难迭来又惨淡，病弱短命真不幸，一生难得报平安。<BR><BR>非业破运的空虚数。（凶）<BR>基业：官星、部将、美术、智能、红艳、凶象。<BR>家庭：亲情不立，兄弟相隐，离祖败家，凡事百忍则家中能平和。<BR>健康：泥牛进海，难以为继。三才配合不善者命运多难，病弱。金木者安全。<BR>含义；物将坏之象。具有短命非业的诱导，所谓大凶之运一不生不得平安，灾祸频临，为如意，陷于逆境。或导至病弱，短命，非业，破灭，";
//             SL81_cn[21] =  "明月中天，万物形成确定之势，能为领导，兴家立业。（女性用则不吉，婚姻不顺）<BR>诗曰：明月光照乐依依，唉如梅花待放时，男人头领女不宜，各个独立有权威。<BR><BR>明月照光，体质刚健之数。（大吉）<BR>基业：天官、太极、文昌、哲学，财库，福禄，首领，君臣，富翁。<BR>家庭：六亲和睦，有中之嗣惠，若女人不为吉，用则破大运。<BR>健康：秋月芙蓉，状年健状、长寿。<BR>含义：风光霁月之象，万物形成自立这势。独立权威，能为首领之运。为人尊仰，享受富贵显荣。路径属渐进发展，中途难免相当苦心";
//             SL81_cn[22] =  "秋草逢霜，徒劳无功，百事不如意，人生多波折。<BR>诗曰：秋草逢霜不如意，不平不满却难依，逆境挫折意志薄，身世凋零心过劳。<BR><BR>秋草逢霜的斗争数。（凶）<BR>基业：远洋、天乙，君臣，将星、劫赌，市财。<BR>健康：常有暗疾，三好四怯或医短命。<BR>含义；百事不如意，志向半途而废，多属懦弱，正职秋草逢霜之象，困难，病弱无气力，陷孤独，逆境不平常，但也有伟人，豪杰有此数者，不过其人生多波折。";
//             SL81_cn[23] =  "旭日东升的发育旺盛数，伟大的领导运，权力旺盛，感情锐利可爱。（女性用则不吉，婚姻不顺）<BR>诗曰：旭日东升势壮当，男属头领女寡向，终至荣达功名显，龙虎添翼声势强。<BR><BR>旭日东升发育旺盛数。（大吉）<BR>基业：首领、君臣、暗禄、财库、进宅、学士。<BR>家庭；男人园地，女人则零落，人格此数多克夫。<BR>含义：伟大昌隆之运。威势冲天之象，微贱出身，逐渐长大，终至首领。有如凯旋之将，猛虎添翼之势。权力旺盛，致胜事业，功名荣达，大志大业可成。但平常气血强旺，临事恐过度而为憾。然而感情锐";
//             SL81_cn[24] =  "金钱丰盈数，德智兼备，白手成家，财产愈来愈丰厚，财库。<BR>诗曰：家门余庆福无疆，子孙繁荣富贵强，白手成家立大业，财源广进智谋全。<BR><BR>家门余庆的金钱丰盈数。（大吉）<BR>基业：大官、福星、文昌、企业，财库、君臣，工商、富贵。<BR>家庭；不依祖业而立身，家庭圆满，兄弟和睦，但应保持无私。<BR>健康：松柏常青，可望长寿。<BR>含义：路途多有崎岖，实为难免。然而策略智谋出众，白手可以成家，财源广进到老愈直，子孙继承余庆的福运。";
//             SL81_cn[25] =  "英俊、资性英敏、性格刚毅。有才华、但性情不平衡，偏重一方，言语柔中带硬，应谦虚。<BR>诗曰：资性英敏有奇能，柔中带硬真性情，修身涵养与人和，奏功获得大鸿图。<BR><BR>英俊，资性英敏的刚毅数。（大吉）<BR>基业；君臣、首领、福星、文昌、企业、财禄、技艺、财库、进田。<BR>健康：健康自在，三才善良者可望长寿。<BR>含义：资性英敏，有奇特的才智，唯性情不平衡而偏重于一方，言语多少有点棱角柔中带硬，性格刚毅，与外人打交道缺谦虚。培养谦虚品性，修身涵养，以其英俊之才，有望成大业。";
//             SL81_cn[26] =  "英雄运格，一生波涛重叠，变故颇多，富有义气侠情，爱助人为乐，但却好运难随。（女性用则不吉，婚姻不顺）<BR>诗曰：变怪异奇多曲折，吉凶极端终无益，变乱艰难缠身凶，家破人亡祸灾强。<BR><BR>变怪奇异的豪侠数。（半吉）<BR>基业：豪侠、君臣、官禄、侠义，红舞，财库、凶危。<BR>家庭：亲情无义妻子无助，若子女温顺可得圆满。<BR>健康：属波漾重叠，数奇怪变化的英雄运格。有义气侠情，然而变化常多，风波不息此数中人，临万能，过死线，而奏大功者有之，力不足，随波逐流，碰波折而破产亡家者有之。又因";
//             SL81_cn[27] =  "自我心过强，多受诽谤攻击，诽难运，就算本身温顺而富有，也不免背后内部是非不息。<BR>诗曰：迎新去旧无限度，批难中折亦多劳，欲望无止到难与，矫正弱点接待人。<BR><BR>欲望天上境，宜静待时数。（半吉）<BR>基业：天官，将军，师长，学士，文昌，凶厄，破财，残疾。<BR>家庭：六亲不得利，兄弟远离。<BR>健康：病，刑罚，心脏病，短命，先天五行为水者可望安全。<BR>含义：自我心强，多会诽谤攻击，而易致失败。所谓难运，大多为半路中折之象，始以其智谋，努力奋斗博得名利待过中年，势惭趋大，内外";
//             SL81_cn[28] =  "遭难运，有义气侠情，但人格有此数者，凡文人、学者在事业上难得建树。（女性用则不吉，婚姻不顺）<BR>诗曰：自豪生离终身苦，遭难不安何可渡，夫妻相克家落薄，结成冤仇造敌城。<BR><BR>豪气生离的行踪无定数。（凶）<BR>基业：天官，将星，官性，学士，红艳。<BR>家庭：亲属多忌怨，兄弟少联络，子女别离。<BR>健康：三才不良者病灾，残疾，发狂，三才善良者无大害。<BR>含义：堪称遭难运，有一种英雄气概，多于波澜起伏，但难逃非难诽谤，时或厄难袭来，而致伤，或丧失配偶，相克子孙，也可能有自幼别";
//             SL81_cn[29] =  "有财力，有活动能力，但是不平不足的念头不断，欲望无止境，多失败。（女性用则不吉，婚姻不顺）<BR>诗曰：欲望难足希望大，计谋成功财力来，猜疑妒忌性自改，如龙乘云时运开。<BR><BR>泉舟顺展的大立功数。（半吉）<BR>基业：天官，太极，君臣，天厨，将星，财帛，文昌，深谋，富翁。<BR>家庭;乏祖力，地格为时，有乏子息或不和。<BR>健康：先天五行为金而三才善良者，可望安康，土火者弱病之虑。<BR>含义：智谋优异，奏功受福之格，财力活动力俱备，成就大业之相，但是不足不平的念头不绝，任意行事，";
//             SL81_cn[30] =  "沉浮不定，吉凶难分，其运就开矿探险一般。<BR>诗曰：绝死逢生多危险，投机浮沈受灾殃，处事细虑保安然，若无终生孤独人。<BR><BR>绝境逢生的运路分岐数。（凶）<BR>基业：官星，将星，文昌，豪放，红艳，血支，实厄。<BR>家庭：亲情不亲，夫妻不相合难同白头。<BR>健康：刑罚，外伤，残疾，先天五行为金者可安然。<BR>含义：浮沉不定，凶吉难分。即因其他运的配合，或者成功，或者陷于失败，故有吉运者，成功自至，数理不良者不知不觉之间陷于失败。其不可测，就象开矿探险一样，大成大败，具有侥幸。另";
//             SL81_cn[31] =  "此数大吉，富贵繁荣的领导运，女性用亦无妨。<BR>诗曰：智勇得志意气新，建立声誉事业成，富贵幸福将有到，为人领导德望高。<BR><BR>智勇德智，可享清福。（大吉）<BR>基业：太极，君臣，将星，学士，文星，田宅，祖业。<BR>家庭：可望幸福，子女多萌，地格被克者刚不过。<BR>含义：智仁勇俱备，意志坚固，千挫不挠，脚步踏实，能成就大业的运格，可率众人，博得名誉，繁荣富贵幸福，属温柔平静，运势强大的首领运。";
//             SL81_cn[32] =  "性格温顺，得意外之福德。<BR>诗曰：侥幸所得贵人扶，善捉机会有财富，认真努力向前程，家门隆昌得富荣。<BR><BR>侥幸多能的意外惠泽运。（大吉）<BR>基业：天德，月德，君臣，将星，文星，学士，文昌，进宅，祖业。<BR>家庭：家门隆星，可能园满，子孙旺发，男有双妻之格。<BR>健康：可能圆满，而三才者有略患。<BR>含义：饶幸多望之格，若能长辈提携，其成功势如破，世品性良，大有爱护他人之德，家门隆昌，繁荣，至上吉数。";
//             SL81_cn[33] =  "功威智谋，名闻天下，常人恐不堪当。（女性用则不吉，婚姻不顺）<BR>诗曰：家门隆昌精神爽，协得名利星月朗，女乃孤寡不堪当，男是天下富豪翁。<BR><BR>家门昌隆，才德开展数。（大吉）<BR>基业：天官，臣将，部长，文昌，学士，田宅，富翁。<BR>家庭：可望幸福，身强口硬，妇女用则孤寡。<BR>健康：可望健康，三才不善或不合先天五行者，病患亦有之。<BR>含义：鸾风相会之象，形成确定之意。多功威智谋，刚毅果断有如旭日东升，旺极昌隆至极，属名闻天下的吉祥数。但如果过刚毅，反致误事，而且过贵重，";
//             SL81_cn[34] =  "此数大凶，破家亡身，绝不可用。<BR>诗曰：破家亡身死无丧，艰难不绝多波浪，大凶一到黄泉客，何谓用此名定凶。<BR><BR>破家亡身的见识浅少数。（凶）<BR>基业：臣将，君臣，文昌，学士，破财，凶厄，破灭。<BR>家庭：家缘薄，妻子分离，忍耐可保症安。<BR>健康：短命，杀伤，刑罚，脑溢血，麻疹，发狂，先天五行三才善才者也可以得安康。<BR>含义：属破坏的大凶运。乱离的祸象颇强，凶煞一到，便接连而来，事业生大凶大困难，大辛苦，内外破乱，万事龊龌，衰败，悲痛无限，因其他数的配关系，有病弱短命";
//             SL81_cn[35] =  "高楼望月，优雅发展，此数最合女性，或那些性格过强之人。<BR>诗曰：温和平安好艺才，努力前程福将来，此数最合女人态，一般多是守财人。<BR><BR>温和平静的优美发展数。（大吉）<BR>基业：将相，学士，文昌，艺术，财库，田宅，工商，温柔。<BR>家庭：上流家庭，可能园满，被运格克者，病苦亦有之。<BR>含义：温良和顺之象，有智达的能力，在文艺技术方面定能发展而奏功洋洋，若怀大志，欲为大事者，宜大振力气，彻底节义，以补不彻底的赋性和权威号召力，因其缺少谋略气魄，故此数实为保守平安的吉祥数，所以";
//             SL81_cn[36] =  "风波不息，枉费心力，&nbsp;为义气侠情舍己成人，一生难得平安，辛苦困难。<BR>诗曰：风浪不静难得安，侠情波浪万事难，务养精神小微利，为人挑难做风头。<BR><BR>风浪不平静的枉费力数。（凶）<BR>基业：将星，学士，文昌，文相，破厄，凶煞，崩山，劫家。<BR>家庭：六亲不力，夫妻离合，子息宜迟，应多做善事，以含积德。<BR>健康：短命，病患，外伤，病疾，三才善良者，可望安康。<BR>含义：为波澜重叠，浮沉万状的英雄运，为侠气义睛敦厚，杀身成人之格，一生难得平安，辛苦困维多，袖手不进失";
//             SL81_cn[37] =  "权威显达，发展基业数，但其人应多注意平和，否则有孤独之感。<BR>诗曰：权威显达得众望，忠实热诚运集旺，大德奏功无难事，终得富荣乐康旺。<BR><BR>权利显达，发展基业数。（大吉）<BR>基业：将星，官禄，文昌，艺术，权利，祖业。<BR>家庭：家庭和睦圆满，女性若有烈强，官守女德，则有可望。<BR>健康：长寿多，先天五行或人格克者，易患疾病，少数为心脏病。<BR>含义：独立，权威，忠实，奏功无比之象，主畅通达，热诚忠烈，得众信，破万难而成大业，慈祥有德，善发挥才能，享受天福之幸，终身富贵至";
//             SL81_cn[38] =  "意志薄弱、实在缺乏领导的才干，但是向文学技术方面发展则有较强的上进心。<BR>诗曰：意志薄弱无威望，长于技艺得长风，始终努力向上去，将见收得光明路。<BR><BR>意志薄弱的刻决经数。（半吉）<BR>基业：将星，学基，臣将，神童，技艺，凶煞，伤杀。<BR>家庭：亲属冷淡，兄弟无助，宜平和可满。<BR>健康：灾维，外伤，肮病，三才配合者尚可园满，<BR>含义：非于大成，实乏统率的人心，缺乏首领的才干，属于有志而乏力，不得众信，一种薄弱平凡之象，自然易险于不幸失意而难以成功，但象文学技术方面发展";
//             SL81_cn[39] =  "富贵繁荣却变化无穷数，常人不堪当。（女性用则不吉，婚姻不顺）<BR>诗曰：富贵荣华实可当，光明荣达好儿郎，女人有此定孤寡，藏有悲惨逢凶险。<BR><BR>富贵荣华的变化无穷数。（大吉）<BR>基业：臣将，文昌，艺术，智能，财库，进田。<BR>家庭：安宁自在，可望园满，子孙昌盛，三才被克者则不园满。<BR>健康：可望安康，三才不善者有病弱。<BR>含义;此数为祸乱一过，反成幸福贵重之格，权利，长寿，财帛丰富，德泽四乡，财富盈身，富贵已极，暗埋悲惨之象，所谓物极必反，切勿轻用之。妇女若有此数者必";
//             SL81_cn[40] =  "富智能威力，但含不逊之心，缺乏威望，宜平和保守。<BR>诗曰：谨慎保安勿自骄，智谋胆略又显晓，批难变转冒险处，刑场遭难孤独悲。<BR><BR>谨慎治安的豪胆迈进数。（凶）<BR>基业：将星，文昌，学士，豪杰，胆量，凶灾，祸厄，劫财<BR>家庭：亲情远淡，兄弟分离。<BR>健康;凶病，胃病外伤，三才善良者可弥补。<BR>含义：富智谋，有心机，然含不逊之心，乏声望，易受诽谤功击，外于浮沉协凶的歧路上，好危险投资，依其他运关系，有酿刑伤罪。犯病者有陷病弱，独短命者，有爱动反招失败，故为进而招祸。";
//             SL81_cn[41] =  "德高望重，事事如意数，能成大业的最大好运。<BR>诗曰：德望高大名誉振，智谋健全财源进，富贵荣华福碌至，前途洋洋得意真。<BR><BR>德高望重的事事如意数。（大吉）<BR>基业：将星太极，名人，老者，学士，学者，官禄，财库，福星。<BR>家庭：家庭圆满，子孙昌盛，地格被克者不遇。<BR>健康：可望健康长寿，二才不善者不遇。<BR>含义;纯明独秀的吉数，胆力才谋具备，健全，有德，能成大业，顺利的最大好运数。";
//             SL81_cn[42] =  "十艺不成的穷困已极数，博识多能、精通世情，无奈十艺九不成，要专心进取。<BR>诗曰：十艺不成学艺真，博达艺能结果因，意志薄弱不取心，将于陷落孤独人。<BR><BR>十艺不成的穷困已极数。（凶）<BR>基业：君臣，部将，官星，文昌，劫煞，灾厄，凶变。<BR>家庭：亲情无义，朋友无缘，妻子反目，三才善者则无妨。<BR>健康：病弱，先天五行为火，者可望安康，但须三才善良。<BR>含义：博识多能，有技艺，精通世情，无奈十艺九不成，多薄弱不如意，缺乏自信心为寂寞悲苦之象，失意之状，如果专心进取，或者可";
//             SL81_cn[43] =  "须防邪途灾害加重，散财破产运，毅力不确定，薄弱之象，外观幸福，内多困苦。<BR>诗曰：雨夜之花是薄命，虚做假实总无影，失去信用无地行，终老无依入黄泉。<BR><BR>须防邪途灾祸重数。（凶）<BR>基业：将星，文字之星，学者，凶星。灾厄伤残。<BR>家庭：妻弱无助，子多不肖，心心相印，三才善良者无妨。<BR>健康：病弱，外伤，短命，三才善良才可平安。<BR>含义：散财破产运，因循姑切，犹如夜雨之花，薄弱散滹之象，虽有才能知识，意力不确定，诸事不能随行，外观幸福，内多困苦，表面依然成事，里面不";
//             SL81_cn[44] =  "愁眉难展破家财，暗淡辛苦悲运来，遭难逆境无所止，配合不宜有横死。难用心计，事难遂愿，贪功好进，必招失败。须眉难展，力量有限数，最大凶运的暗示。一生多遇困难﹐若注重亲人关系﹐适时积财﹐也可谓平安。（平），清家荡产之最凶之数也，藏有家财破败，人口离异，暗淡惨苦之悲运，诅事不能如意，多障碍，逆境，病患等，如他运配合关系有致发狂横死等之不幸，于壮年或中年时如有一时的幸运，然而至于中年末就倾泻一尽，故斯时应谨慎节俭以济晚年之凄凉，但有不出世之怪杰，伟人，烈士，孝子，节妇等诅此数。，「愁眉难展」<BR>";
//             SL81_cn[45] =  "新生泰和的万事如意数，富贵繁荣至极，如五格配合不当则可能转为凶运。<BR>诗曰：新生泰运顺行舟，排除万难总无忧，成功繁荣四海明，荣华富贵好前程。<BR><BR>新生泰和万事如意数。（大吉）<BR>基业：部将，君臣，文昌，学士，艺术。<BR>健康：可望圆满，子孙昌盛，三才不善者不寓，安康长寿，人格被克者不才。<BR>含义：顺风扬帆之象，经纬深，智谋大，可遂大志大业，克破万难而成功，富贵繁荣至极，但若与运的凶数结合，即如浪里失舵船，易遭灾难。";
//             SL81_cn[46] =  "载宝沉舟之象，有大成功者，也有大失败者。<BR>诗曰：罗网击身运大凶，一生困苦受灾难，身病孤贫无可靠，难得平安船逆风。<BR><BR>须防复失的离祖破家数。（凶）<BR>基业：臣将，将星，学士，豪杰，文昌，凶厄，崩山。<BR>家庭;亲多往且子孙宜迟，三才善者可弥补。<BR>健康：刑罚，病弱，短命，外伤，暗伤，三才善者可望健。<BR>含义：载宝沉舟之象，乏力，薄弱，悲衰困难辛苦，破坏失败者多，然而属一类变怪的命运，有大艰难尝尽后而又成功者，或依其他命运的关系，致陷孤独刑罚，病患短命等灾祸，总之";
//             SL81_cn[47] =  "开花结果，权威进取数。可得天赋的幸福，可进可退，退可以守的大吉运。<BR>诗曰：开花结子衣食在，荣华富贵福招来，子孙繁荣多快乐，一家圆满庆有余。<BR><BR>开花结果的权威进取数。（大吉）<BR>基业：君臣，将星，文昌，学士，艺术，高傲，食禄，财库。<BR>家庭：家庭圆满，然时有争执，三才不善者和睦相处。<BR>健康：可望长寿，健康，三才不善者，也有病弱，短命的可能。<BR>含义：开花之象，祯祥吉庆之数，可享天赋的幸福，与朋友合作以成大事大业，真是进可以攻，退可以守福，可遗禄于子孙的吉运。";
//             SL81_cn[48] =  "德智兼备最宜为人之师，或他人的顾问。<BR>诗曰：有德且智德望高，堪为顾问得人和，名誉利达天赋高，威望荣达世间夸。<BR><BR>德智兼备的出身清贵数。（大吉）<BR>基业：将相，官禄，文昌，学士，文艺，财库。<BR>家庭：家庭圆满，子孙满堂，三才不善者不寓。<BR>健康：良好，可望长寿，三才不善者不寓。<BR>含义：才望谋略齐备，内含坚刚，为功利荣达的吉数，宜为人的顾问，威望洋洋，乃师数也。";
//             SL81_cn[49] =  "吉凶难分，不断辛苦。<BR>诗曰：吉凶难分运歧路，三才配置好鸿图，若是逢凶灾害至，终老变成苦安居。<BR><BR>吉凶难分的不断辛苦数。（半吉）<BR>基业：臣相，将星;文昌，智谋，学士，凶象，散财。<BR>健康：凶灾，病灾外伤，短命，三才不善者可补救，<BR>家庭：六亲得力，子自宜退。<BR>含义：处吉凶的岐路，吉临则吉又生大吉，凶来则凶又变大凶，所以成败不得失极其浩大，有处大凶而其他方面化吉者，其幸福与不幸，专靠三才配合的好坏，以及其他运的联系显现，多陷落于灾祸。";
//             SL81_cn[50] =  "吉凶参半，须防倾覆。<BR>诗曰：一成一败一瞬间，浮沈未定难得安，与时不知宜戒心，败衰始觉已运迟。<BR><BR>吉凶参半，需防倾覆数。（半吉半凶）<BR>基业：将官，文昌，财钱，灾祸，离愁，散财。<BR>家庭：亲属多而无助。<BR>健康：刑罚，杀伤，意外之灾，外伤，白痴，狂癫等疾。<BR>含义：成败之象，先得五字的数理庇荫，而成大业，享按富贵，后由盈数（凡十谓之盈数）的暗示诱导而成陷失败，亡身破于晚年，凄惨至极，若其他运又凶数者，则是惨上加惨。杀伤，离秋，孤单频临，或至于刑罚。";
//             SL81_cn[51] =  "一盛一衰，竭力经营。<BR>诗曰：成衰交加命运期，一时名利就分歧，平生保守平安路，到老变成苦安居。<BR><BR>盛衰交加的竭力经营数。（半吉）<BR>基业：文昌，学士，节度，时禄，劫煞，败退<BR>家庭：时有争执，灾祸病患，三才善者安康自在<BR>含义：一盛一衰之象，必然可得昌盛，搏得一时名利，然后发现运中自然的凶兆，到晚年出挫折困苦。遂至失败。";
//             SL81_cn[52] =  "有先见之明，理想实现数，无中生有名利双收大吉数。<BR>诗曰：先见机明会佳期，意志坚固庆有余，功名利达福双全，一世荣华乐千锺。<BR><BR>先见之明，理想实现数。（大吉）<BR>基业：元帅，医师，文昌，技艺，财库，官禄，财星<BR>家庭：幸福，顺从行孝，子女和睦，三才不善者不遇。<BR>健康：可望健康，长寿，人格被克者不遇，<BR>含义：属于运将申之象，势能强大，无中生有的运数，有先见之明，计划必成，眼能察时世，富投机心，有谋略，他人之难不为难，实现大志大业而名利双收，因为有眼光而成功。";
//             SL81_cn[53] =  "外观幸福，内多障碍，如前半生幸福就是后半生不幸，如前半生不幸就是后半生幸福，大多凶运。<BR>诗曰：心内忧愁无人知，外盛内衰迫近期，晚年多灾荡家尽，若得幸运护好持。<BR><BR>忧仇困苦，内心忧愁数。（凶）<BR>基业：伟人，学示，时禄，磨难，灾祸，劫煞<BR>家庭：亲眷寡情，乏子息<BR>健康：病灾，祸患，外伤，刑罚，三才善者或可谜补<BR>含义：外观依然吉庆臻辉，内实祸患甚多，若非前半生不幸而后半生幸福，便是前半生富贵而后半生落魄，及盛衰参半的运数，一旦陷入凶煞，大多破家身亡，即使的吉";
//             SL81_cn[54] =  "多难悲运，难望成功，大凶运的暗示。<BR>诗曰：多难非运多障害，忧苦不和祸又来，横死刑场终惨绝，饿死定数是大凶。<BR><BR>多难悲运的难望成功数。（凶）<BR>基业：文昌，技艺，凶灾，劫煞，时禄，灾祸<BR>家庭：父母入过客，兄弟似残星，和睦相处，亦可无大过，<BR>健康与含义：为大凶煞按示，悲惨不绝，不和损伤，忧闷频来，遂至倾家荡财，或患废疾，刑罚，短命横死孤独等。";
//             SL81_cn[55] =  "外美内苦，和顺不实数。<BR>诗曰：外美内苦暗伤悲，一面极盛一面衰，吉凶参半难以定，克服难关会佳期。<BR><BR>外美内恶的和顺不实数。（半吉）<BR>基业：非官，技艺，文昌，学者，灾祸<BR>家庭：亲眷忌，父母老病，尽心忠孝可天大过<BR>健康：三才善者可健全，余则不过安康。<BR>含义：五数为最吉数，五上添五乃是最吉重叠，反而生凶相了，故表面颇为隆盛，而内里则是灾祸叠生，凡事不能安心，危难别离，病难等无所不至因而是吉凶相办的运格，志弱者绝无立身之地，善能震雄威，坚心为业志，打破万难也可";
//             SL81_cn[56] =  "缺乏实行的勇气，万事难行，最凶的运格。<BR>诗曰：暮日凄凉事难成，进取心薄不安然，万事龌龊精力败，晚运惨至破家财。<BR><BR>初历尽困苦，四周障碍数。（凶）<BR>基业：豪杰，文昌，时禄，文艺，红艳，灾祸，伤身<BR>家庭：不可靠亲的福，残嘣。<BR>健康：外伤，病难，维残，短命，三才善者可望安全。<BR>含义：缺乏实行的勇气，缺乏进取的精神，损失，灾祸等，是祸不单行者。万事龆龃啮龃，财力不足，乃是最大的运格。<BR>";
//             SL81_cn[57] =  "寒雪春松的最大荣运数，资性刚毅，黑夜过后便是天明。<BR>诗曰：寒雪青松性刚强，一生一度遇灾殃，然后发达利亨通，终生繁荣福无疆。<BR><BR>寒雪青松的最大运数。（大吉）<BR>基业：官禄，文昌，学士，艺能，时禄，财库，进田。<BR>家庭：文田不严，时有冲突，三才善者，可得圆满。<BR>健康：自在，可望长寿，三才不善者不在此数。<BR>含义：寒岭春格，资格刚毅，获天赋之幸福而招致富贵，但这一生必遭大难一次，然后得享吉祥，繁荣，百事可以如意。";
//             SL81_cn[58] =  "先苦后甜，大都晚年幸福。<BR>诗曰：先苦后甘有苦思，难关度过福人扶，晚年幸福兼余庆，合如甘蔗好尾甘。<BR><BR>先苦后甜，气宏扬堍数。（半吉）<BR>基业：官禄，文昌，学士，技艺，灾厄，伤残。<BR>家庭：亲情少，兄弟离，须互相信任。<BR>健康：伤残，刑罚，外伤，三才善者可望平安。<BR>含义：浮沉多端，祸福无常，所得福分，必经大失败大患难后方能显著，家破产亡后方得富贵荣华，大都蔗根生甜。晚年享受安庆。";
//             SL81_cn[59] =  "无办事能力，愁苦一生。<BR>诗曰：车轮无毅不能行，失意逆境却难定，一旦过灾终不起，终为非命注凶程。<BR><BR>须防外患的时运不济数。（凶）<BR>基业：官星，福星，文昌，智能，灾厄，伤残，财库，破厄。<BR>家庭;亲情无缘，子女背景离乡。<BR>健康：病患，短命，三才善者可望平安。<BR>含义：乏耐心缺勇气，意志衰退，无办事的才能，终于悲苦一生。";
//             SL81_cn[60] =  "无谋不算岂能成功。一生无成。<BR>诗曰：黑暗无光不安定，苦惨刑伤事难成，病弱短命多困苦，徒加烦劳损精神。<BR><BR>争名夺利，黑暗无光数。（凶）<BR>基业：官星，将星，文昌，智能，技艺灾厄，伤残。<BR>家庭：祖宗无基，亲友无情，兄弟无缘，三才善者可弥补。<BR>健康：外伤，病疫，短命等。<BR>含义：属晦冥黑暗，摇动不安的凶象，方向不喧尽任风波的运格，无谋不算而计划岂能成功，故难免失败苦恼或刑罚，杀伤，伤疾患，短命等。";
//             SL81_cn[61] =  "名利双收，繁荣昌盛。无奈傲慢不逊，易酿成内外不和家庭反目，可能是常说的为富不仁。宜平和。<BR>诗曰：名利双收富贵荣，修身养德防未然，傲慢不逊失人和，恐有家庭起风波。<BR><BR>名利双收的修行积德数。（大吉）<BR>基业：将星，文昌，贩运艺，财库，财帛，破厄。<BR>家庭：自立成家，衣食富足。<BR>健康：可望长寿，安康，三才不良者无此数。<BR>含义：名利双收，繁荣富贵的吉数，无奈骄漫不逊，致酿成内外不和，家庭反目，兄弟离于墙，表面装表堂皇，里面空虚，如果能修德慎行，切守和顺，自可防于";
//             SL81_cn[62] =  "基础虚弱，渐入衰败。<BR>诗曰：基础虚弱重信用，不和衰败招灾殃，生涯不安因素起，步步留意保平安。<BR><BR>基根虚弱的艰困厄数。（凶）<BR>基业：国印，文昌，虚度，将星，技艺，灾厄，三才善者可安全。<BR>家庭：分贵，骨肉分离。<BR>健康：伤残，外伤，刑罚，短命，灾厄，三才善者可安全。<BR>含义：内外不和，缺乏信用，志望难达，渐进衰败之境，意外灾祝频来，属身弱步步惨的数。";
//             SL81_cn[63] =  "富贵荣华，万事如意，最大吉数。<BR>诗曰：富贵荣华得显宁，子孙繁茂福绵绵，一身平安兼益寿，福禄双全享千种。<BR><BR>富贵荣华的身心安数。（大吉）<BR>基业：官禄，将星，文星，艺能，财库，田宅，商工。<BR>家庭：子女多，顺川散敬爱，圆满之象。<BR>含义：万物承惠露而发育状大之状，属不费心神，万事如意，荣显可传子孙的最大吉数。";
//             SL81_cn[64] =  "骨肉分离，一生多忧。<BR>诗曰：骨肉分离难平安，浮沈破坏病又难，非业因苦无可靠，生涯孤独多悲哀。<BR><BR>骨肉分离，孤独悲恨数。（凶）<BR>基业：将星，学士，技艺，厄，破财，劫煞。<BR>家庭：一称多忧，妻子欠破。<BR>健康：水厄，利罚，病患，外伤，三才善者可平安。<BR>含义：此数为破坏，灭懑，沉滞的凶象，有意外灾祸袭来，或骨肉离散，或病患非命临身，人生逡得安心。";
//             SL81_cn[65] =  "富贵四方，天长地久，一生平安。<BR>诗曰：富贵长寿逢吉祥，家运隆昌喜气扬，福禄繁荣兼富贵，万事皆通可安宁。<BR><BR>富贵长亲的富贵四方数。（大吉）<BR>基业：臣君，将星，官禄，文昌，技艺，财库，田宅，时禄。<BR>家庭：祖业有根基，子孙昌杰，三才不善才无此数。<BR>健康：多施恩德则能益寿延年，安康自在。<BR>含义：天长地久，家庭隆昌，福寿棉长，事事成就，一生平安，多贵重的气运。";
//             SL81_cn[66] =  "进退失自由，内外不和。<BR>诗曰：内外不和不自由，进退两难总是忧，难若亦灭艰难到，灾厄交加悲惨运。<BR><BR>风外不和的多祸失福数。（凶）<BR>基业：将星，豪杰，灾厄，崩山，散财，破财。<BR>家庭：六亲冷淡不相投，兄弟远离。<BR>健康：刑罚，外伤，亡身，残伤，短命。<BR>含义：进退失自由，内外不和，艰难不堪，损伤灾祸交至。大有家破灭亡的凶相。";
//             SL81_cn[67] =  "利路亨通的坚强数,万事无障碍达目的，家道昌盛好运数。<BR>诗曰：利路亨通万事成，和畅通达四海明，家运隆盛招富贵，万商云集得繁荣。<BR><BR>利路享通的坚强数。（大吉）<BR>基业：君臣，将星，文昌，硕士，刚性，艺能，财库，进田。<BR>家庭：父母多荫，子女多考，圆满幸福。三才不善者时有争执，宜守和平。<BR>健康：安全，可望长寿，先天五行为大业。三才不善者有时患呼吸器官疾病。<BR>含义：受长辈上级的援助，万事无障而达到目地，是天助的幸运，实现南望。家道繁昌，富贵好运数。";
//           
//SL81_cn[68] =  "兴家立业，宽容好运。<BR>诗曰：兴家立业意志强，智虑周密名望扬；志操坚固信用重，一生艺才献机能。<BR><BR>坐立不安处世多难数。（凶）<BR>基业：将相，学士，文昌，财帛，荣誉，暗禄，进田。节度。<BR>家庭：幸福，三才不善者无此数。。<BR>健康：良好，三才不善者的疾病。<BR>含义：智虑周全，志向坚定，勤勉力行，发展奋进之象。有发明的才能，集众信，愿望发达，名实而全的运数。";
//SL81_cn[69] =  "坐立不安，处世多难。<BR>诗曰：坐立不安如萍动，病灾非业逢波浪，发疾短命祸根生，精神失意发狂异。 <BR><BR>坐立不安处世多难数。（凶）<BR>基业：将星，财帛，学士，文昌，技能，艺术，破厄，劫财。<BR>家庭：六亲不相投，兄弟难相处，不宜心直口快。<BR>健康：刑罚，外伤，病灾，伤残，天生五行为金者可望平安。<BR>含义：穷迫，滞塞，逆境之数，缺乏坚定信念，灾祸交至，摇动为安，致陷于短命，病疾或尝尽痛苦而死。";
//SL81_cn[70] =  "家庭衰退，晚景凄凉。<BR>诗曰：废物灭亡不中用，一生惨淡贫困穷，忧苦乱离异端数，招致久病不起重。<BR><BR>家庭衰退的晚景凄凉数。（凶）<BR>基业：官星，学士，文库，巧星，财库，破厄，劫禄。<BR>家庭：父母难当，兄弟无助，妻子宜尽。<BR>健康：病患，残疾，外伤，先天五行为金木者为健全。 <BR>含义：险恶亡灭之象，一生惨淡，忧伤峭绝，有空虚寂寞之感，维免杀伤，残疾，刑罚，短命，离散等灾厄，不然便是世上无用之人。";
//SL81_cn[71] =  "本应享天赋的幸福，但缺乏进取的勇气，故称吉凶参半数。<BR>诗曰：养神耐劳得安然，嫌力不足乏实行，片面幸福内麻烦，修身养德计事成。<BR><BR>没有实质的磨神耐劳数。（半吉）<BR>基业：技艺，文昌，学士，破厄，劫禄。<BR>家庭：时有争执，宜守平和。<BR>健康：外伤，少些病患，三才善者安康。<BR>含义：备有生成的吉运，自应享受富贵福禄，无奈内心勒苦甚多，缺乏实行贯彻的精神，进取的勇气稀少致陷失败，故称吉凶参半的运数。";
//SL81_cn[72] =  "心比天高、命比纸薄，无大业可成，但大都可平安度日。<BR>诗曰：志高力微乏实行，妄谋无计事难成，晚年平安静逸祥，享得天赋增吉祥。<BR><BR>志高力微的努力奋斗数。（半吉）<BR>基业：技艺、文昌、艺术、时禄、厄星、红艳。<BR>家庭：六亲无缘，夫妻旗鼓相当，难为儿女。<BR>健康：良好，须防阴病和眼疾。<BR>含义：盛衰交加之象，无实行贯彻之勇，徒有高志而无成事之能，然而天生福气，大都终世平安。";        
//SL81_cn[73] =  "志高力微、努力奋。<BR>诗曰：盛衰交加,徒有高志,天王福祉,终世平安。<BR><BR>志高力微的努力奋半数。（凶）<BR>基业：技艺、文昌、艺术、时禄、厄星、红艳。。<BR>家庭：六亲无缘，夫妻旗鼓相当，难为儿女。。<BR>健康：良好，须防阴病和眼疾。。<BR>含义：盛衰交加之象，无实行贯彻之勇，徒有高志而无成事之能，然而天生福气，大都终世平安。";         
//SL81_cn[74] =  "无用之辈、衰叹命运。<BR>诗曰：沈沦逆境无智慧，徒衣徒食亦难然，老来不过难出世，一生非运叹人生。<BR><BR>沉沦逆境的秋叶落寞数。（凶）<BR>基业：技艺、文昌、时禄、破厄、红艳、劫禄。<BR>家庭：妻子不知心，亲情无助，宜开朗心胸。<BR>健康：时遇伤残、病患、刑罚、短命，先天五行为土者安康自在。<BR>含义：无能无智、仅取得衣食，真世上无有之辈。县易生意外之灾，辛苦繁多，沉沦逆境，哀叹命运。";            
//SL81_cn[75] =  "守则平安，进则失败。<BR>诗曰：守则可安无忧事，龌龊失意害自私，妄进大败因所谓，总是宜静不宜动。<BR><BR>守者可安，发迹甚迟数。（半吉）<BR>基业：将星、学士、时禄、破厄、灾动、文昌。<BR>家庭：可望圆满。<BR>健康：安康，三才不善者有病患。<BR>含义：虽有自然之吉相，无奈策划未成，若要做大事，便招失败痛苦，退过可保吉祥，进取必陷失意灾";
//             SL81_cn[76] =  "骨肉分离，内外不和，多病弱短命。<BR>诗曰：倾覆离散家破财，内外不和无可靠，家散丧妻悲愁限，贫病交迫寿又短。<BR><BR>倾覆离散，虽劳无功数。（凶）<BR>基业：豪杰、文昌、将星、劫禄、破财。<BR>家庭：六亲无缘，夫妇分离，乏子息。<BR>健康：外伤、废疾、先天五行为金者平安。<BR>含义：内外不和，骨肉分离，逆境凶煞无限，倾家破产亡身的悲运数。故多病弱短命、妻子离愁。";
//             SL81_cn[77] =  "前半生幸福便后半生不幸；后半生幸福便前半生不幸。<BR>诗曰：乐极生悲吉与凶，长上余德福禄强，前佳后劣悲叹运，半身劳尽终吉祥。<BR><BR>家庭有悦的半凶半吉数。（半吉）<BR>基业：将星、财帛、劫禄、破厄。<BR>家庭：六亲不得力，子息宜迟。<BR>健康：须防肺病，先天五行为土得平安。<BR>含义：多获上级援护，幸福享至中年，然后陷落不平，悲叹灾厄，如果有悲运于前半生者，后半生却反得吉祥。";
//             SL81_cn[78] =  "晚景凄凉，功德渐败。<BR>诗曰：晚境凄伧相侵生，中年渐渐发达来，晚年困苦逢秋冷，难免守居得安然。<BR><BR>晚境凄凉的功德光荣数。（凶）<BR>基业：将星、学士、技艺、破厄、劫财、突破。<BR>家庭：亲缘少，兄弟疏，宜多联络。<BR>健康：宜防呼吸病，负伤、遭难，先天五行为水土者，可望健全。<BR>含义：福祸虽有参半，凶相较多一些，天生智能齐备，是以中年以前成功发达，乃至中年后，渐自衰退，陷于困苦、大悲惨的暗示。";
//             SL81_cn[79] =  "精神不安，为世所弃。<BR>诗曰：挽回乏力无善谋，精神不定如云黑，失节丧信无所至，受人评击却责难。<BR><BR>挽回乏力的身疲力尽数。（凶）<BR>基业：将星、学士、时禄、破厄、灾厄、文昌、劫财。<BR>家庭：亲眷疏、兄弟不和，凡事谨慎则平安。<BR>健康：外伤、病患，先天五行为金木者可望安全。<BR>含义：穷迫不伸的逆境，精神不定，缺乏实行的能力，乏贞节，失信用，受攻击非难，为世所弃，成个废人，但身体却健康。";
//             SL81_cn[80] =  "一生困难辛，夭折者多，但早入隐遁的生活，可安心立命。<BR>诗曰：吉星入遁多波浪，覆之一数正安乐，幸福遁来富贵儿，名扬四海吉祥余。<BR><BR>凶星入度的清本缩小数。（凶）<BR>基业：将星、技艺、学者、时禄、破财、灾厄。<BR>家庭：家中口舌多，不可多言。<BR>健康：病患多，三才善者可望平安。<BR>含义：一生困难辛苦不绝，病患、刑伤、夭折者多，但早入隐遁的生活者，可以安心立命，化凶转吉。";
//             SL81_cn[81] =  "还原复始之最大吉之数。好运之巅峰。<BR>诗曰：还元复始重临福，九九八一还本元，八二之数与二灵，此诀玄理覆数传。<BR><BR>万物回春，还原复始的积极盛大数。（大吉）<BR>基业：天福、天官、赐禄、财库、将星、技艺、文昌。<BR>家庭：子女俱佳，兄弟圆满，家庭和睦。<BR>健康：身心健全，可望长寿，三才不善者可能病患。<BR>含义：最极之数，还本归元，属于体力旺盛，庆幸万多，吉祥重叠，富贵尊荣的大诱导之数。";
//
//         }
//     } 
//
//     static int GetValue(String Sval)
//     {
//         int szpf = 0;
//         switch(Sval)
//         {
//             case "大吉":
//                 szpf = 12;
//                 break;
//             case "吉":
//                 szpf = 8;
//                 break;
//             case "半吉":
//                 szpf = 5;
//                 break;
//             case "大凶":
//                 szpf = 0;
//                 break;
//             case "凶":
//                 szpf = 1;
//                 break;
//             case "半凶":
//                 szpf = 2;
//                 break;
//             case "平":
//               szpf = 4;
//                 break;
//         }
//         return szpf;
//     }
//
//     static String GetSancai(int iVal)
//     {
//         switch (iVal % 10)
//         {
//             case 0:
//                 return "水";
//             case 1:
//             case 2:
//                 return "木";
//             case 3:
//             case 4:
//                 return "火";
//             case 5:
//             case 6:
//                 return "土";
//             case 7:
//             case 8:
//                 return "金";
//             case 9:
//             case 10:
//                 return "水";
//             default:
//                 return "";
//         }
//     }
//
//     static double TotalToNum(int 天格, int 人格, int 地格, int 总格, int 外格)
//     {
//    	 
//    	 System.out.println( 天格 +"=-"+ 人格 +"=-"+ 地格 +"=-"+ 总格 +"=-"+外格);
//    	 
//         String S三才 = GetSancai(天格) + GetSancai(人格) + GetSancai(地格);
//         String[] sval = GetSanCaiJX(天格, S三才);
//         
//         System.out.println( Get81(天格));
//         System.out.println( Get81(人格));
//         System.out.println( Get81(地格));
//         System.out.println( Get81(总格));
//         System.out.println( Get81(外格));
//         return TotalToNum(Get81(天格), Get81(人格), Get81(地格), Get81(总格), Get81(外格),sval[0], sval[1], sval[2], sval[3], 总格);
//     }
//
//     static double TotalToNum(String 天格, String 人格, String 地格, String 总格, String 外格, String 三才, String 基础, String 成功, String 人际,int i总格)
//     {
//    	 
//    	 
//    
//    	 
//    	 
//    	 
//         double iTotal = 0;
//         iTotal = GetValue(天格) / 10
//             + GetValue(人格)
//             + GetValue(地格)
//             + GetValue(总格)
//             + GetValue(外格)/10
//             + GetValue(三才)/4
//             + GetValue(基础)/4
//             + GetValue(成功)/4
//             + GetValue(人际)/4;
//
//         System.out.println("总分："+iTotal);
//         
//         if (i总格 > 60)
//         {
//             iTotal -= 5;
//         }else
//         {
//             iTotal += 50;
//         }
//         
//         System.out.println("总分："+iTotal);
//         return iTotal;
//     }
////     xmdf=getpf(tgjx)/10+getpf(rgjx)+getpf(dgjx)+getpf(zgjx)+getpf(wgjx)/10+getpf(scjx)/4+getpf(jcyjx)/4+getpf(cgyjx)/4+getpf(rjgxjx)/4
//	  //if zhonggee>60 then
////   xmdf = xmdf - 5
//
////   end if
//	  //xmdf=50+xmdf%>
//
//     static String[] GetSanCaiJX(int 天格,String 三才)
//     {
//         String[] Sval = new String[4];
//         switch(三才)
//         {
//             case "火火火":
//                 Sval[0] = "平";
//                 Sval[1] = "但天格为1或2时吉利。";
//                 Sval[2] = "平";
//                 Sval[3] = "凶";
//                 if((天格 ==1 )||(天格==2))
//                 {
//                     Sval[1] = "吉";
//                 }
//                 break;
//             case "火火金": Sval[0] = "凶"; Sval[1] = "平"; Sval[2] = "平"; Sval[3] = "平"; break;
//             case "火火木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "平"; Sval[3] = "凶"; break;
//             case "火火水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "平"; Sval[3] = "凶"; break;
//             case "火火土":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为3或4时,则内部易产生分离倾向,且容易短寿。";
//                 Sval[2] = "平";
//                 Sval[3] = "凶";
//                 if ((天格 == 3) || (天格 == 4))
//                 {
//                     Sval[1] = "平";
//                 }
//                 break;
//             case "火金火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "火金金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "火金木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "火金水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "火金土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "火木火":
//                 Sval[0] = "吉";
//                 Sval[1] = "但天格为9或10时,则天格地格相克而为凶兆。";
//                 Sval[2] = "吉";
//                 Sval[3] = "吉";
//                 if ((天格 == 9) || (天格 == 10))
//                 {
//                     Sval[1] = "凶";
//                 }
//                 break;
//             case "火木金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "火木木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "火木水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "火木土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "火水火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "火水金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "火水木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "火水水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "火水土": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "火土火": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "火土金": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "火土木": Sval[0] = "平"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "火土水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "火土土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "金火火":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为1或2时吉利。";
//                 Sval[2] = "凶";
//                 Sval[3] = "平";
//                 if ((天格 == 1) || (天格 == 2))
//                 {
//                     Sval[1] = "吉";
//                 } 
//                 break;
//             case "金火金": Sval[0] = "凶"; Sval[1] = "平"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金火木": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金火水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金火土":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为3或4时,则内部易产生分离倾向,且容易短寿。";
//                 Sval[2] = "凶";
//                 Sval[3] = "凶";
//                 if ((天格 == 3) || (天格 == 4))
//                 {
//                     Sval[1] = "平";
//                 }
//                 break;
//             case "金金火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "金金金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金金木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "金金水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金金土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金木火":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为9或10时,则天格地格相克而为凶兆。";
//                 Sval[2] = "凶";
//                 Sval[3] = "吉";
//                 if ((天格 == 9) || (天格 == 10))
//                 {
//                     Sval[1] = "凶";
//                 }
//                 break;
//             case "金木金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金木木": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金木水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金木土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金水火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "金水金": Sval[0] = "吉"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金水木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金水水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金水土": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "金土火": Sval[0] = "平"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "金土金": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "金土木": Sval[0] = "平"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "金土水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "金土土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "木火火":
//                 Sval[0] = "平";
//                 Sval[1] = "但天格为1或2时吉利。";
//                 Sval[2] = "吉";
//                 Sval[3] = "吉";
//                 if ((天格 == 1) || (天格 == 2))
//                 {
//                     Sval[1] = "吉";
//                 }
//                 break;
//             case "木火金": Sval[0] = "凶"; Sval[1] = "平"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "木火木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "木火水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "木火土":
//                 Sval[0] = "吉";
//                 Sval[1] = "但天格为3或4时,则内部易产生分离倾向,且容易短寿。";
//                 Sval[2] = "吉";
//                 Sval[3] = "凶";
//                 if ((天格 == 3) || (天格 == 4))
//                 {
//                     Sval[1] = "平";
//                 }
//                 break;
//             case "木金火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "木金金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "木金木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "木金水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木金土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木木火":
//                 Sval[0] = "吉";
//                 Sval[1] = "但天格为9或10时,则天格地格相克而为凶兆。";
//                 Sval[2] = "吉";
//                 Sval[3] = "吉";
//                 if ((天格 == 9) || (天格 == 10))
//                 {
//                     Sval[1] = "凶";
//                 }
//                 break;
//             case "木木金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "木木木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "木木水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "木木土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "木水火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木水金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木水木": Sval[0] = "吉"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木水水": Sval[0] = "平"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "木水土": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "木土火": Sval[0] = "平"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "木土金": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "木土木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "木土水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "木土土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "水火火":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为1或2时吉利";
//                 Sval[2] = "凶";
//                 Sval[3] = "凶";
//                 if ((天格 == 1) || (天格 == 2))
//                 {
//                     Sval[1] = "吉";
//                 }
//                 break;
//             case "水火金": Sval[0] = "凶"; Sval[1] = "平"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "水火木": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "水火水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "水火土":
//                 Sval[0] = "凶";
//                 Sval[1] = "但天格为3或4时,则内部易产生分离倾向,且容易短寿。";
//                 Sval[2] = "凶";
//                 Sval[3] = "吉";
//                 if ((天格 == 3) || (天格 == 4))
//                 {
//                     Sval[1] = "平";
//                 }
//                 break;
//             case "水金火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "水金金": Sval[0] = "平"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "水金木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "水金水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "水金土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "水木火":
//                 Sval[0] = "平";
//                 Sval[1] = "但天格为9或10时,则天格地格相克而为凶兆。";
//                 Sval[2] = "吉";
//                 Sval[3] = "吉";
//                 if ((天格 == 9) || (天格 == 10))
//                 {
//                     Sval[1] = "凶";
//                 }
//                 break;
//             case "水木金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "水木木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "水木水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "水木土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "水水火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "水水金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "水水木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "水水水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "水水土": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "水土火": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "平"; Sval[3] = "平"; break;
//             case "水土金": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "平"; Sval[3] = "吉"; break;
//             case "水土木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "平"; Sval[3] = "吉"; break;
//             case "水土水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "平"; Sval[3] = "吉"; break;
//             case "水土土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "平"; Sval[3] = "凶"; break;
//             case "土火火":
//                 Sval[0] = "平";
//                 Sval[1] = "但天格为1或2时吉利。";
//                 Sval[2] = "吉";
//                 Sval[3] = "凶";
//                 if ((天格 == 1) || (天格 == 2))
//                 {
//                     Sval[1] = "吉";
//                 }
//                 break;
//             case "土火金": Sval[0] = "平"; Sval[1] = "平"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "土火木": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土火水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土火土":
//                 Sval[0] = "吉";
//                 Sval[1] = "但天格为3或4时,则内部易产生分离倾向,且容易短寿。";
//                 Sval[2] = "吉";
//                 Sval[3] = "平";
//                 if ((天格 == 3) || (天格 == 4))
//                 {
//                     Sval[1] = "平";
//                 }
//                 break;
//             case "土金火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "土金金": Sval[0] = "吉"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土金木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土金水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土金土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "凶"; break;
//             case "土木火":
//                 Sval[0] = "平";
//                 Sval[1] = "但天格为9或10时,则天格地格相克而为凶兆。";
//                 Sval[2] = "凶";
//                 Sval[3] = "凶";
//                 if ((天格 == 9) || (天格 == 10))
//                 {
//                     Sval[1] = "凶";
//                 }
//                 break;
//             case "土木金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "土木木": Sval[0] = "平"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "土木水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "土木土": Sval[0] = "凶"; Sval[1] = "吉"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "土水火": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "土水金": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "凶"; break;
//             case "土水木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "土水水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "平"; break;
//             case "土水土": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "凶"; Sval[3] = "吉"; break;
//             case "土土火": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土土金": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//             case "土土木": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "土土水": Sval[0] = "凶"; Sval[1] = "凶"; Sval[2] = "吉"; Sval[3] = "平"; break;
//             case "土土土": Sval[0] = "吉"; Sval[1] = "吉"; Sval[2] = "吉"; Sval[3] = "吉"; break;
//         }
//
//         return Sval;
//
//     }
//	
//	
//	
//	
//	static  int rod(){
//		
//		
//		
//		 int max=50,min=10;
//		 int ran2 = (int) (Math.random()*(max-min)+min); 
//		
//		
//		return ran2;
//
//	}
//	
//	
//	
//	
//	
//	
//	
//	
//	
//	
//}
